#!/usr/bin/bash
VER="0.5 Beta for Linux.sh"
VERMENU="1 Awesul"

# инициализация функций
function pause(){ read -p "Нажмите ENTER для выхода..."
}

# заставка
clear
echo ..........................................................
echo ..........................................................
echo ..........................................................
echo ..//////////............//////////.......////.............
echo ..///////////...........//////////.......////.............
echo ..///....////...........////.............////.............
echo ..////...////...........////.............////.............
echo ..////////............../////////........////.............
echo ..////////////........../////////........////.............
echo ..///.....////..........////.............////.............
echo ..////....////....//....////.......//....////.........//..
echo ..////////////...////...////......////.../////////...////.
echo ..//////////.....////...////......////.../////////...////.
echo ..........................................................
echo ...Batus.For.Linux.sh...........................BETA......
echo ..........................................................
echo Проснитесь и пойте мистер $USER, проснитесь и пойте
echo
sleep 2
# следующая часть
clear
date
echo
OPTIONS="версия отчистка запуск перезагрузка настройки выход"
select opt in $OPTIONS; do
           if [ "$opt" = "версия" ]; then
             clear
             echo ..........................................................
             echo ..........................................................
             echo ..........................................................
             echo ..//////////............//////////.......////.............
             echo ..///////////...........//////////.......////.............
             echo ..///....////...........////.............////.............
             echo ..////...////...........////.............////.............
             echo ..////////............../////////........////.............
             echo ..////////////........../////////........////.............
             echo ..///.....////..........////.............////.............
             echo ..////....////....//....////.......//....////.........//..
             echo ..////////////...////...////......////.../////////...////.
             echo ..//////////.....////...////......////.../////////...////.
             echo ..........................................................
             echo ...Batus.For.Linux.sh...........................BETA......
             echo ..........................................................
             echo
             echo Версия - $VER
             echo Версия меню - $VERMENU
             echo
             uname -a
             echo
             pause
             exit
           elif [ "$opt" = "отчистка" ]; then
             clear
             echo Отчистка /tmp с root правами...
             echo Введите пароль для полной отчистки:
             sudo rm -rf /tmp
             echo Отчищено
             sleep 3
             clear
             exit
           elif [ "$opt" = "запуск" ]; then
             clear
                OPTIONS="discord firefox steam nautilus"
                select opt in $OPTIONS; do
                    if [ "$opt" = "discord" ]; then
                        discord
                    elif [ "$opt" = "firefox" ]; then
                        firefox
                    elif [ "$opt" = "steam" ]; then
                        steam
                    elif [ "$opt" = "nautilus" ]; then
                        nautilus
                    else
                        echo это так не работает
                    fi
                done
             exit
           elif [ "$opt" = "перезагрузка" ]; then
             echo Введита пароль для перезагрузки:
             sudo reboot
           elif [ "$opt" = "настройки" ]; then
             clear
                OPTIONS="выход"
                select opt in $OPTIONS; do
                    if [ "$opt" = "выход" ]; then
                        exit
                    fi
                done
             exit
           elif [ "$opt" = "выход" ]; then
             clear
             exit
            else
             echo это так не работает
           fi
done
